/*MODBUS最大帧长*/
#define MODBUS_BUFSZ  50

/*MODBUS帧接/发控制结构体*/
typedef struct
{
    UINT32  ticks;            /* 接收最后一个字符的时刻 */
    UINT16  pos;              /* buf数组存储下标 */

    UINT8   buf[MODBUS_BUFSZ];/* MODBUS功能码之后所有内容 */
} ModbusFrame;

#define HEAD_485   0x20
#define END_485    0x0D
/*****************************************************************************/
/* MODBUS接收处理函数                                                        */
/*****************************************************************************/
void Modbus_recv (ModbusFrame *f, UINT8 ch);

/*****************************************************************************/
/* MODBUS帧检查函数，判断帧是否接收完成，如果成功则返回 (1)                  */
/*****************************************************************************/
BOOL Modbus_check (ModbusFrame *f,UINT16 len);

/*****************************************************************************/
/* MODBUS校验和计算函数                                                      */
/*****************************************************************************/
UINT16 Modbus_crc (const UINT8 *buf, UINT16 len);

/*****************************************************************************/
/* MODBUS控制信息初始化                                                      */
/*****************************************************************************/
void Modbus_init (ModbusFrame *f);
